{
  "monti": {
    "appId": "4iFT6vBRtz8b7TBjp",
    "appSecret": "85ce8cea-1fab-48b7-be2b-4af22e522244"
  },

  "defaultAccounts": [
    { "email": "admin@foo.com", "password": "changeme", "role": "admin" },
    { "email": "john@foo.com", "password": "changeme", "role": "student" },
    { "email": "company@foo.com", "password": "changeme", "role": "company" }
  ],

  "defaultData": [
    { "name": "Basket", "quantity": 3, "owner": "john@foo.com", "condition": "excellent" },
    { "name": "Bicycle", "quantity": 2, "owner": "john@foo.com", "condition": "poor" },
    { "name": "Banana", "quantity": 2, "owner": "admin@foo.com", "condition": "good" },
    { "name": "Boogie Board", "quantity": 2, "owner": "admin@foo.com", "condition": "excellent" }
  ],

  "defaultCompanyData": [
    {"name": "KaloStems", "logo": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fphilipmjohnson&psig=AOvVaw0AUW32mpADjN5LMNZkwDUs&ust=1712869514546000&source=images&cd=vfe&opi=89978449&ved=0CBIQjRxqFwoTCIjSranGuIUDFQAAAAAdAAAAABAE", "address": "Aloha Street", "email": "email.com", "links": "kalostem.com", "description": "this is a description", "owner": "john@foo.com"
    }
  ],

  "defaultStudents": [
    { "fullName": "Rina Ogino",
      "image": "https://github.com/rinaogino.png",
      "email": "rin4@hawaii.edu",
      "phoneNumber": "(808) 222-2222",
      "major": "B.S. Computer Science",
      "graduationDate": "May 2025",
      "skills": "JavaScript, Meteor, HTML, CSS",
      "awards": "N/A",
      "description": "I am a undergraduate student studying Computer Science with a minor in Japanese at the University of Hawaii at Manoa. My journey in my academics has been driven by a fascination with numbers and a keen interest in databases, as well as the study of various languages and cultures. Some of my other interests include community involvement, traveling, surfing, and snowboarding. I am expected to graduate in the Spring of 2025.",
      "linkedIn": "https://www.linkedin.com/in/rinaogino",
      "gitHub": "https://github.com/rinaogino/"
    },
    { "fullName": "Jaira Pader",
      "image": "https://github.com/rinaogino.png",
      "email": "rin4@hawaii.edu",
      "phoneNumber": "(808) 222-2222",
      "major": "B.S. Computer Science",
      "graduationDate": "May 2025",
      "skills": "JavaScript, Meteor, HTML, CSS",
      "awards": "N/A",
      "description": "I am a undergraduate student studying Computer Science with a minor in Japanese at the University of Hawaii at Manoa. My journey in my academics has been driven by a fascination with numbers and a keen interest in databases, as well as the study of various languages and cultures. Some of my other interests include community involvement, traveling, surfing, and snowboarding. I am expected to graduate in the Spring of 2025.",
      "linkedIn": "https://www.linkedin.com/in/rinaogino",
      "gitHub": "https://github.com/rinaogino/"
    }
  ],

  "defaultJobs": [
    { "title": "Welcome Center Management Assistant",
      "description": "Respond to a high volume of phone and email inquiries related to campus visits and undergraduate admission\nGreets, assists, and directs students and visitors to appropriate offices, services, resources, or classrooms over the phone, in-person, or in email\nAnswers calls to the main Office of Admissions telephone number using a multi-line phone and directs calls as needed to appropriate offices\nAssists in the management and sorting of emails to be distributed to admissions team\nAssist in the greeting and check-in of visitors\nMaintain a welcoming and professional reception area for the Welcome Center\nAssist the Welcome Center Coordinator in maintaining a positive, clean, and welcoming environment",
      "requirements": "Excellent organizational skills - can handle organizing, sorting, and responding to a large volume of emails\nAbility to answer and make calls in a clear professional manner\nMust have a pleasant and professional phone voice\nExcellent oral and written communication skills\nReliable, punctual and able to work with minimal supervision\nFamiliar with Microsoft Office, Google Suite; good typing skills\nPositive attitude and willingness to work as a member of a team\nAdhere to a strict policy of confidentiality\nAbility to lift and carry up to 25 lbs\nMust be a graduate student",
      "wage": "21.25", "company": "University of Hawaii - Manoa", "deadline": "06/30/2024 at 11:00PM HST", "seats": "1"},
    { "title": "Dental Assistant",
      "description": "Prepare patients for treatment and maintain a steady patient flow.\nReview patient health history, take vital signs if deemed necessary, document in patient record, and assure completion of forms and signatures.\nTaking and developing dental radiographs as prescribed by the dentist.\nMaintains a sterile and neat working environment according to current infection control procedures.\nMake preliminary and impressions of patients’ teeth and pour models and trim casts when needed. Make custom trays for patients for denture procedures.\nPrepare and maintain dental instruments, equipment, and supplies.\nUnderstands and demonstrates ability to protect patient privacy according to HIPAA laws.\nOther duties as assigned.",
      "requirements": "Completion of dental assisting, other recognized training program or in office training is required.\nA minimum of 1-year dental assisting experience (need to have to be called in for an interview) OR an RDA/CDA certification.\nUnderstand practices and techniques of a dental office setting.\nBasic computer skills needed to access electronic dental records.\nAbility to communicate effectively with patients, community members, and staff members.\nReading, writing, and basic knowledge at a high school level is needed.",
      "wage": "TBD", "company": "Waikiki Health Center", "deadline": "05/01/2024 at 11:00PM HST", "seats": "2"},
    { "title": "#161 Credit Analyst II",
      "description": "Responsible for analyzing financial statements, preparing loan memorandums, gathering information related to commercial customers, and assisting in the administration of the bank’s credit policies. College degree in Business, Finance or Accounting preferred. Experience in credit analysis, loan structuring and documentation. Knowledgeable of various cash flow formats. Excellent written and verbal communication skills. Proficiency in Word and Excel. Ability to work effectively under pressure and to meet deadlines.",
      "requirements": "Credit Analyst II requires at least 1-2 years of experience in financial statement analysis, cash flow analysis and preparation of credit memorandums",
      "wage": "TBD", "company": "Hawaii National Bank", "deadline": "06/26/2024 at 11:00PM HST", "seats": "1"},
    { "title": "Architecture Intern - Summer 2024",
      "description": "Support multi-disciplinary team in developing designs, schematic sketches/diagrams, and documentation drawings.\nAssist in the preparation of design presentations.\nUtilize BIM software as a tool for design drawings.\nPrepare presentations, including graphic design and PowerPoint.\nEffective teaming within the project team.",
      "requirements": "Familiarity in Revit, Rhino and/or Sketch-up.\nFamiliarity with Photoshop, InDesign, Illustrator and Microsoft Office essential\nGood communication skills and the ability to work effectively with others\nAbility to work in an energetic and challenging work environment\nMust be able to work remotely when necessary.\n\nPlease include a portfolio with your submission.\nEducation and Experience\nWorking toward a BA or BS in Architecture, Bachelor of Architecture, or Master of Architecture degree. Please note: We are looking for someone who is currently pursuing an Architectural degree from an accredited school. If you have already graduated, please check our website for other full-time positions that might be more suitable for you.",
      "wage": "18.45 - 27.12", "company": "Stantec Consulting Services", "deadline": "05/27/2024 at 11:00PM HST", "seats": "1"}
  ]
}
